<!DOCTYPE html>
<html>
<body>
<div align="center">
<h3>Prepared by Asif Bhat</h3>
    
<h1>Pandas - Series & Dataframes</h1>

<h3>Follow Me on - <a href="https://www.linkedin.com/in/asif-bhat/">LinkedIn</a>&nbsp; <a href="https://mobile.twitter.com/_asifbhat_">Twitter</a>&nbsp; <a href="https://www.instagram.com/datasciencescoop/?hl=en">Instagram</a>&nbsp; <a href="https://www.facebook.com/datasciencescoop/">Facebook</a></h3>
</div>
</body>
</html>

In [85]:
import glob
import math
import re

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [86]:
!pip install numpy

Requirement already satisfied: numpy in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (1.18.2)

# Merge Dataframes

In [87]:
t1 = pd.DataFrame({'myfamily':['ziba','Abolghasem', 'Emma']})
t2 = pd.DataFrame(['Ziba','Abolghasem', 'Emma'], columns=['MyFamily'], index=['row1','row3','row3'])
display(t1,t2)

     myfamily
0        ziba
1  Abolghasem
2        Emma

        MyFamily
row1        Ziba
row3  Abolghasem
row3        Emma

In [88]:
daf1 = pd.DataFrame(
    {
        "id": ["1", "2", "3", "4", "5"],
        "Name": ["Asif", "Basit", "Bran", "John", "David"],
    }
)
daf1

  id   Name
0  1   Asif
1  2  Basit
2  3   Bran
3  4   John
4  5  David

In [89]:
daf2 = pd.DataFrame({"id": ["1", "2", "6", "7", "8"], "Score": [40, 60, 80, 90, 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [90]:
# Inner Join
pd.merge(daf1, daf2, on="id", how="inner")

  id   Name  Score
0  1   Asif     40
1  2  Basit     60

In [91]:
# Full Outer Join
pd.merge(daf1, daf2, on="id", how="outer")

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN
5  6    NaN   80.0
6  7    NaN   90.0
7  8    NaN   70.0

In [92]:
# Left Outer Join
pd.merge(daf1, daf2, on="id", how="left")

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN

In [93]:
# Right Outer Join
pd.merge(daf1, daf2, on="id", how="right")

  id   Name  Score
0  1   Asif     40
1  2  Basit     60
2  6    NaN     80
3  7    NaN     90
4  8    NaN     70

# Importing multiple CSV files in DataFrame
> https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_daily_reports

In [94]:
import pandas as pd

In [95]:
df = pd.read_csv(
    "../../data/sample_covid19.csv"
)  # for each root folder lever to reach we add "../""

In [96]:
df

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key
0,45001.0,Abbeville,South Carolina,US,2020-05-17 02:32:32,34.223334,-82.461707,34,0,0,34,"Abbeville, South Carolina, US"
1,22001.0,Acadia,Louisiana,US,2020-05-17 02:32:32,30.295065,-92.414197,192,11,0,181,"Acadia, Louisiana, US"
2,51001.0,Accomack,Virginia,US,2020-05-17 02:32:32,37.767072,-75.632346,668,9,0,659,"Accomack, Virginia, US"
3,16001.0,Ada,Idaho,US,2020-05-17 02:32:32,43.452658,-116.241552,773,22,0,751,"Ada, Idaho, US"
4,19001.0,Adair,Iowa,US,2020-05-17 02:32:32,41.330756,-94.471059,4,0,0,4,"Adair, Iowa, US"
...,...,...,...,...,...,...,...,...,...,...,...,...
3299,NaN,NaN,NaN,West Bank and Gaza,2020-05-17 02:32:32,31.952200,35.233200,376,2,329,45,West Bank and Gaza
3300,NaN,NaN,NaN,Western Sahara,2020-05-17 02:32:32,24.215500,-12.885800,6,0,6,0,Western Sahara
3301,NaN,NaN,NaN,Yemen,2020-05-17 02:32:32,15.552727,48.516388,122,18,1,103,Yemen
3302,NaN,NaN,NaN,Zambia,2020-05-17 02:32:32,-13.133897,27.849332,679,7,183,489,Zambia
3303,NaN,NaN,NaN,Zimbabwe,2020-05-17 02:32:32,-19.015438,29.154857,42,4,13,25,Zimbabwe

In [97]:
# Append all CSV files 
path =r'../../data/'
filenames = glob.glob(path + "sample_covid19.csv")
print(filenames)
covid = pd.DataFrame()
for f in filenames:
    df = pd.read_csv(f)
    covid = covid.append(df,ignore_index=True,sort=True)

['../../data/sample_covid19.csv']

In [98]:
# Top 10 rows of the Dataframe
covid.head(5)

,Active,Admin2,Combined_Key,Confirmed,Country_Region,Deaths,FIPS,Last_Update,Lat,Long_,Province_State,Recovered
0,34,Abbeville,"Abbeville, South Carolina, US",34,US,0,45001.0,2020-05-17 02:32:32,34.223334,-82.461707,South Carolina,0
1,181,Acadia,"Acadia, Louisiana, US",192,US,11,22001.0,2020-05-17 02:32:32,30.295065,-92.414197,Louisiana,0
2,659,Accomack,"Accomack, Virginia, US",668,US,9,51001.0,2020-05-17 02:32:32,37.767072,-75.632346,Virginia,0
3,751,Ada,"Ada, Idaho, US",773,US,22,16001.0,2020-05-17 02:32:32,43.452658,-116.241552,Idaho,0
4,4,Adair,"Adair, Iowa, US",4,US,0,19001.0,2020-05-17 02:32:32,41.330756,-94.471059,Iowa,0

In [99]:
# Bottom 10 rows of the Dataframe
covid.tail(5)
covid.sample(10)
covid.shape

(3304, 12)

In [100]:
# Reading columns
covid["Country_Region"].value_counts()  # .head(10)

US             2985
China            33
Italy            21
Spain            19
Germany          17
               ...
Senegal           1
Philippines       1
Oman              1
Kosovo            1
Cuba              1
Name: Country_Region, Length: 188, dtype: int64

In [101]:
# Reading columns
df1 = covid[["Last_Update", "Country_Region", "Province_State", "Confirmed"]]
df1.head(10)
# df1.iloc
df1.iloc[:]
df1.iloc[[1, 2, 3], [1, 2]]
df1.iloc[1, 3]

192

In [102]:
# Read specific rows
df1.iloc[0:-1]

              Last_Update      Country_Region  Province_State  Confirmed
0     2020-05-17 02:32:32                  US  South Carolina         34
1     2020-05-17 02:32:32                  US       Louisiana        192
2     2020-05-17 02:32:32                  US        Virginia        668
3     2020-05-17 02:32:32                  US           Idaho        773
4     2020-05-17 02:32:32                  US            Iowa          4
...                   ...                 ...             ...        ...
3298  2020-05-17 02:32:32             Vietnam             NaN        318
3299  2020-05-17 02:32:32  West Bank and Gaza             NaN        376
3300  2020-05-17 02:32:32      Western Sahara             NaN          6
3301  2020-05-17 02:32:32               Yemen             NaN        122
3302  2020-05-17 02:32:32              Zambia             NaN        679

[3303 rows x 4 columns]

In [103]:
# Filter data
df1.loc[1:5,'Last_Update':'Confirmed']

           Last_Update Country_Region Province_State  Confirmed
1  2020-05-17 02:32:32             US      Louisiana        192
2  2020-05-17 02:32:32             US       Virginia        668
3  2020-05-17 02:32:32             US          Idaho        773
4  2020-05-17 02:32:32             US           Iowa          4
5  2020-05-17 02:32:32             US       Kentucky         92

In [104]:
display(
    "This is heading for our dataframe",
    "Abbas",
    df1.sort_values(["Country_Region"], ascending=False).head(10),
)

'This is heading for our dataframe'

'Abbas'

              Last_Update      Country_Region Province_State  Confirmed
3303  2020-05-17 02:32:32            Zimbabwe            NaN         42
3302  2020-05-17 02:32:32              Zambia            NaN        679
3301  2020-05-17 02:32:32               Yemen            NaN        122
3300  2020-05-17 02:32:32      Western Sahara            NaN          6
3299  2020-05-17 02:32:32  West Bank and Gaza            NaN        376
3298  2020-05-17 02:32:32             Vietnam            NaN        318
3297  2020-05-17 02:32:32           Venezuela            NaN        504
3296  2020-05-17 02:32:32          Uzbekistan            NaN       2738
3295  2020-05-17 02:32:32             Uruguay            NaN        733
2993  2020-05-17 02:32:32      United Kingdom        Bermuda        123

In [105]:
# Sort Data Frame
display(
    "Sorted Data Frame", df1.sort_values(["Country_Region"], ascending=True).head(5)
)

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
3123  2020-05-17 02:32:32    Afghanistan            NaN       6402
3124  2020-05-17 02:32:32        Albania            NaN        933
3125  2020-05-17 02:32:32        Algeria            NaN       6821
3126  2020-05-17 02:32:32        Andorra            NaN        761
3127  2020-05-17 02:32:32         Angola            NaN         48

In [106]:
# Sort Data Frame
display(
    "Sorted Data Frame", df1.sort_values(["Country_Region"], ascending=False).head(5)
)

'Sorted Data Frame'

              Last_Update      Country_Region Province_State  Confirmed
3303  2020-05-17 02:32:32            Zimbabwe            NaN         42
3302  2020-05-17 02:32:32              Zambia            NaN        679
3301  2020-05-17 02:32:32               Yemen            NaN        122
3300  2020-05-17 02:32:32      Western Sahara            NaN          6
3299  2020-05-17 02:32:32  West Bank and Gaza            NaN        376

In [107]:
df1

              Last_Update      Country_Region  Province_State  Confirmed
0     2020-05-17 02:32:32                  US  South Carolina         34
1     2020-05-17 02:32:32                  US       Louisiana        192
2     2020-05-17 02:32:32                  US        Virginia        668
3     2020-05-17 02:32:32                  US           Idaho        773
4     2020-05-17 02:32:32                  US            Iowa          4
...                   ...                 ...             ...        ...
3299  2020-05-17 02:32:32  West Bank and Gaza             NaN        376
3300  2020-05-17 02:32:32      Western Sahara             NaN          6
3301  2020-05-17 02:32:32               Yemen             NaN        122
3302  2020-05-17 02:32:32              Zambia             NaN        679
3303  2020-05-17 02:32:32            Zimbabwe             NaN         42

[3304 rows x 4 columns]

In [108]:
# Sort Data Frame - Ascending on "Country" & descending on "Last update"
display(
    "Sorted Data Frame",
    'This is our second line',
    'this is my third line',
    df1.sort_values(["Confirmed", "Province_State" ], ascending=[0, 0]).loc[
        df1["Country_Region"] == "Canada"
    ].tail(3),
)

'Sorted Data Frame'

'This is our second line'

'this is my third line'

              Last_Update Country_Region         Province_State  Confirmed
3120  2020-05-17 02:32:32         Canada                  Yukon         11
3073  2020-05-17 02:32:32         Canada  Northwest Territories          5
3012  2020-05-17 02:32:32         Canada       Diamond Princess          1

In [109]:
display(
    "Sorted Data Frame",
    df1.sort_values(["Country_Region", "Province_State"], ascending=[1, 1])[
        df1["Country_Region"] == "US"
    ],
)

/Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages/ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
104   2020-05-17 02:32:32             US        Alabama        110
112   2020-05-17 02:32:32             US        Alabama        254
123   2020-05-17 02:32:32             US        Alabama         79
187   2020-05-17 02:32:32             US        Alabama         50
204   2020-05-17 02:32:32             US        Alabama         45
...                   ...            ...            ...        ...
2555  2020-05-17 02:32:32             US        Wyoming         23
2588  2020-05-17 02:32:32             US        Wyoming        100
2648  2020-05-17 02:32:32             US        Wyoming         10
2700  2020-05-17 02:32:32             US        Wyoming          0
2794  2020-05-17 02:32:32             US        Wyoming          9

[2985 rows x 4 columns]

In [110]:
# for i in range(len(df1)):
#     df1.iloc[i]
# for i in df1:
#     cnt = 0
#     while cnt < 10:
#         print(i)
#         cnt += 1

In [111]:
# list(df1.iterrows())

In [112]:
#Iterating through the dataset
for index , row in df1.iterrows():
    if (row['Country_Region'] == 'Indonesia' ):
        display(row[['Country_Region' ,'Confirmed']])

Country_Region    Indonesia
Confirmed             17025
Name: 3199, dtype: object

In [113]:
#Unique Values
covid['Country_Region'].drop_duplicates(keep='first').head(10)

0                   US
2978             Italy
2979            Canada
2980             Spain
2981    United Kingdom
2982             China
2984       Netherlands
2986         Australia
2987           Germany
3017           Denmark
Name: Country_Region, dtype: object

In [114]:
covid

,Active,Admin2,Combined_Key,Confirmed,Country_Region,Deaths,FIPS,Last_Update,Lat,Long_,Province_State,Recovered
0,34,Abbeville,"Abbeville, South Carolina, US",34,US,0,45001.0,2020-05-17 02:32:32,34.223334,-82.461707,South Carolina,0
1,181,Acadia,"Acadia, Louisiana, US",192,US,11,22001.0,2020-05-17 02:32:32,30.295065,-92.414197,Louisiana,0
2,659,Accomack,"Accomack, Virginia, US",668,US,9,51001.0,2020-05-17 02:32:32,37.767072,-75.632346,Virginia,0
3,751,Ada,"Ada, Idaho, US",773,US,22,16001.0,2020-05-17 02:32:32,43.452658,-116.241552,Idaho,0
4,4,Adair,"Adair, Iowa, US",4,US,0,19001.0,2020-05-17 02:32:32,41.330756,-94.471059,Iowa,0
...,...,...,...,...,...,...,...,...,...,...,...,...
3299,45,NaN,West Bank and Gaza,376,West Bank and Gaza,2,NaN,2020-05-17 02:32:32,31.952200,35.233200,NaN,329
3300,0,NaN,Western Sahara,6,Western Sahara,0,NaN,2020-05-17 02:32:32,24.215500,-12.885800,NaN,6
3301,103,NaN,Yemen,122,Yemen,18,NaN,2020-05-17 02:32:32,15.552727,48.516388,NaN,1
3302,489,NaN,Zambia,679,Zambia,7,NaN,2020-05-17 02:32:32,-13.133897,27.849332,NaN,183
3303,25,NaN,Zimbabwe,42,Zimbabwe,4,NaN,2020-05-17 02:32:32,-19.015438,29.154857,NaN,13

In [115]:
# Countries impacted with Coronavirus
countries = covid["Country_Region"].unique()
type(countries), countries

(numpy.ndarray,
 array(['US', 'Italy', 'Canada', 'Spain', 'United Kingdom', 'China',
        'Netherlands', 'Australia', 'Germany', 'Denmark', 'France',
        'Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
        'Antigua and Barbuda', 'Argentina', 'Armenia', 'Austria',
        'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados',
        'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan', 'Bolivia',
        'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Brunei',
        'Bulgaria', 'Burkina Faso', 'Burma', 'Burundi', 'Cabo Verde',
        'Cambodia', 'Cameroon', 'Central African Republic', 'Chad',
        'Chile', 'Colombia', 'Comoros', 'Congo (Brazzaville)',
        'Congo (Kinshasa)', 'Costa Rica', "Cote d'Ivoire", 'Croatia',
        'Cuba', 'Cyprus', 'Czechia', 'Diamond Princess', 'Djibouti',
        'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
        'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
        'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'Gabon', 'Gambia',
        'Georgia', 'Ghana', 'Greece', 'Grenada', 'Guatemala', 'Guinea',
        'Guinea-Bissau', 'Guyana', 'Haiti', 'Holy See', 'Honduras',
        'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
        'Ireland', 'Israel', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan',
        'Kenya', 'Korea, South', 'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos',
        'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
        'Liechtenstein', 'Lithuania', 'Luxembourg', 'MS Zaandam',
        'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
        'Mauritania', 'Mauritius', 'Mexico', 'Moldova', 'Monaco',
        'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Namibia',
        'Nepal', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
        'North Macedonia', 'Norway', 'Oman', 'Pakistan', 'Panama',
        'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
        'Portugal', 'Qatar', 'Romania', 'Russia', 'Rwanda',
        'Saint Kitts and Nevis', 'Saint Lucia',
        'Saint Vincent and the Grenadines', 'San Marino',
        'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
        'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
        'Somalia', 'South Africa', 'South Sudan', 'Sri Lanka', 'Sudan',
        'Suriname', 'Sweden', 'Switzerland', 'Syria', 'Taiwan*',
        'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo',
        'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Uganda', 'Ukraine',
        'United Arab Emirates', 'Uruguay', 'Uzbekistan', 'Venezuela',
        'Vietnam', 'West Bank and Gaza', 'Western Sahara', 'Yemen',
        'Zambia', 'Zimbabwe'], dtype=object))

In [116]:
df2 = pd.read_csv("../../data/Pokemon.csv")
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [117]:
# Sum of Columns 
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,94,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,122,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,162,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,180,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,91,39,52,43,60,50,65,1,False

In [118]:
# df2['temp'] = df2.iloc[:,4:10].sum(axis=1)
# df2

In [119]:
# df2

In [120]:
# Sum of Columns 
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [121]:
cols = list(df2.columns)
cols[-2:]

['Generation', 'Legendary']

In [122]:
# Shifting "Total" column

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Legendary,Speed,Generation
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,False,45,1
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,False,60,1
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,False,80,1
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,False,80,1
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,False,65,1

In [123]:
# Shifting "Legendary" column -  Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Generation,Legendary,Speed
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,1,False,45
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,1,False,60
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,1,False,80
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,1,False,80
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,1,False,65

In [124]:
# Shifting "Generation" column - Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [125]:
# Save to CSV file

df2.to_csv("poke_updated.csv")

In [126]:
# Save to CSV file without index column

df2.to_csv("poke_updated1.csv", index=False)

In [127]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False

In [128]:
# Save Dataframe as text file
df2.to_csv("poke.txt", sep="\t", index=False)

In [129]:
! pip install openpyxl

Requirement already satisfied: openpyxl in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (3.0.3)
Requirement already satisfied: et-xmlfile in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (from openpyxl) (1.4.1)

In [130]:
# Save Dataframe as xlsx file
df2.to_excel("poke.xlsx")

In [131]:
# Save Dataframe as xlsx file without row names
df2.to_excel("poke.xlsx", index=0)

In [132]:
#Filtering using loc
df2[df2['Type 2'] == 'Dragon']
df2.loc[df2['Type 2'] == 'Dragon']

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
196,181,AmpharosMega Ampharos,Electric,Dragon,750,90,95,105,165,110,45,2,False
249,230,Kingdra,Water,Dragon,625,75,95,95,95,95,85,2,False
275,254,SceptileMega Sceptile,Grass,Dragon,665,70,110,75,145,85,145,3,False
360,329,Vibrava,Ground,Dragon,390,50,70,50,50,50,70,3,False
361,330,Flygon,Ground,Dragon,600,80,100,80,80,80,100,3,False
540,483,Dialga,Steel,Dragon,810,100,120,120,150,100,90,4,True
541,484,Palkia,Water,Dragon,790,90,120,100,150,120,100,4,True
544,487,GiratinaAltered Forme,Ghost,Dragon,840,150,100,120,100,120,90,4,True
545,487,GiratinaOrigin Forme,Ghost,Dragon,860,150,120,100,120,100,90,4,True
694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False
761,691,Dragalge,Poison,Dragon,590,65,75,90,97,123,44,6,False
766,696,Tyrunt,Rock,Dragon,461,58,89,77,45,45,48,6,False
767,697,Tyrantrum,Rock,Dragon,653,82,121,119,69,59,71,6,False
790,714,Noibat,Flying,Dragon,260,40,30,35,45,40,55,6,False
791,715,Noivern,Flying,Dragon,567,85,70,80,97,80,123,6,False

In [133]:
# Filtering using loc
df3 = df2.loc[(df2["Type 2"] == "Dragon") & (df2["Type 1"] == "Dark")]
df3

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [134]:
# Reset index for Dataframe df3 keeping old index column

df4 = df3.reset_index()
df4

,index,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
1,695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
2,696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [135]:
# Reset index for Dataframe df3 removing old index column

df3.reset_index(drop=True, inplace=True)
df3

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
1,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
2,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [136]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False

# LIKE OPERATION IN PANDAS
if this 'sub_string' is in 'main_string'

In [137]:
df2

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,700,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,800,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,720,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,840,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,720,80,110,120,130,90,70,6,True

In [138]:
df2.Name.str.contains("rill").sum()

7

In [139]:
class abbas:
    x =8
    def __int__(self, x=8):
        self.x=x
    
    def add(self, y):
        self.y = 1+self.x

In [140]:
t = abbas()
t1 = abbas()
t1.x = 10
result = t1.add(4)

t1.x , t.x, result

(10, 8, None)

In [141]:
# Display all rows containing Name "rill"
df2.loc[df2.Name.str.contains("rill")]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
18,15,Beedrill,Bug,Poison,475,65,90,40,45,80,75,1,False
19,15,BeedrillMega Beedrill,Bug,Poison,565,65,150,40,15,80,145,1,False
198,183,Marill,Water,Fairy,300,70,20,50,20,50,40,2,False
199,184,Azumarill,Water,Fairy,520,100,50,80,60,80,50,2,False
322,298,Azurill,Normal,Fairy,240,50,20,40,20,40,20,3,False
589,530,Excadrill,Ground,Steel,665,110,135,60,50,65,88,5,False
653,592,Frillish,Water,Ghost,390,55,40,50,65,85,40,5,False

In [142]:
# Exclude all rows containing "rill"
df2.loc[~df2.Name.str.contains("rill")].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False

In [143]:
# Display all rows with Type-1 as "Grass" and Type-2 as "Poison"

df2.loc[df2["Type 1"].str.contains("Grass") & df2["Type 2"].str.contains("Poison")]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
48,43,Oddish,Grass,Poison,385,45,50,55,75,65,30,1,False
49,44,Gloom,Grass,Poison,480,60,65,70,85,75,40,1,False
50,45,Vileplume,Grass,Poison,595,75,80,85,110,90,50,1,False
75,69,Bellsprout,Grass,Poison,385,50,75,35,70,30,40,1,False
76,70,Weepinbell,Grass,Poison,490,65,90,50,85,45,55,1,False
77,71,Victreebel,Grass,Poison,605,80,105,65,100,70,70,1,False
344,315,Roselia,Grass,Poison,445,50,60,45,100,80,65,3,False
451,406,Budew,Grass,Poison,295,40,30,35,50,70,55,4,False
452,407,Roserade,Grass,Poison,555,60,70,65,125,105,90,4,False
651,590,Foongus,Grass,Poison,403,69,55,45,55,55,15,5,False
652,591,Amoonguss,Grass,Poison,633,114,85,70,85,80,30,5,False

In [144]:
df2.loc[df2["Type 1"].str.contains("Grass|Water", regex=True)].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False
10,8,Wartortle,Water,NaN,469,59,63,80,65,80,58,1,False
11,9,Blastoise,Water,NaN,614,79,83,100,85,105,78,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,734,79,103,120,135,115,78,1,False
48,43,Oddish,Grass,Poison,385,45,50,55,75,65,30,1,False
49,44,Gloom,Grass,Poison,480,60,65,70,85,75,40,1,False

In [145]:
# Due to Case-sensitive it will not return any data

df2.loc[df2["Type 1"].str.contains("grass|water", regex=True)].head(10)

Empty DataFrame
Columns: [#, Name, Type 1, Type 2, Total, HP, Attack, Defense, Sp. Atk, Sp. Def, Speed, Generation, Legendary]
Index: []

In [146]:
# To ignore case we can use "case = False"

df2.loc[df2["Type 1"].str.contains("grass|water", case=False, regex=True)].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False
10,8,Wartortle,Water,NaN,469,59,63,80,65,80,58,1,False
11,9,Blastoise,Water,NaN,614,79,83,100,85,105,78,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,734,79,103,120,135,115,78,1,False
48,43,Oddish,Grass,Poison,385,45,50,55,75,65,30,1,False
49,44,Gloom,Grass,Poison,480,60,65,70,85,75,40,1,False

In [147]:
# To ignore case we can use "Flags = re.I"

df2.loc[df2["Type 1"].str.contains("grass|water", flags=re.I, regex=True)].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False
10,8,Wartortle,Water,NaN,469,59,63,80,65,80,58,1,False
11,9,Blastoise,Water,NaN,614,79,83,100,85,105,78,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,734,79,103,120,135,115,78,1,False
48,43,Oddish,Grass,Poison,385,45,50,55,75,65,30,1,False
49,44,Gloom,Grass,Poison,480,60,65,70,85,75,40,1,False

# Regex in Pandas dataframe

In [148]:
# Get all rows with name starting with "wa"

df2.loc[df2.Name.str.contains("^Wa", flags=re.I, regex=True)].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
10,8,Wartortle,Water,NaN,469,59,63,80,65,80,58,1,False
350,320,Wailmer,Water,NaN,540,130,70,35,70,35,60,3,False
351,321,Wailord,Water,NaN,700,170,90,45,90,45,60,3,False
400,365,Walrein,Ice,Water,655,110,80,90,95,90,65,3,False
564,505,Watchog,Normal,NaN,488,60,85,69,60,69,77,5,False

In [149]:
# Get all rows with name starting with "wa" followed by any letter between a-l

df2.loc[df2.Name.str.contains("^Wa[a-l]+", flags=re.I, regex=True)].head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
350,320,Wailmer,Water,NaN,540,130,70,35,70,35,60,3,False
351,321,Wailord,Water,NaN,700,170,90,45,90,45,60,3,False
400,365,Walrein,Ice,Water,655,110,80,90,95,90,65,3,False

In [150]:
# Get all rows with name starting with x , y, z

df2.loc[df2.Name.str.contains("^[x-z]", flags=re.I, regex=True)]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
46,41,Zubat,Poison,Flying,275,40,45,35,30,40,55,1,False
157,145,Zapdos,Electric,Flying,660,90,90,85,125,90,100,1,True
192,178,Xatu,Psychic,Flying,515,65,75,70,95,70,95,2,False
208,193,Yanma,Bug,Flying,425,65,65,45,75,45,95,2,False
286,263,Zigzagoon,Normal,NaN,248,38,30,41,30,41,60,3,False
367,335,Zangoose,Normal,NaN,556,73,115,60,60,60,90,3,False
520,469,Yanmega,Bug,Flying,582,86,76,86,116,56,95,4,False
582,523,Zebstrika,Electric,NaN,556,75,100,63,80,63,116,5,False
623,562,Yamask,Ghost,NaN,341,38,30,85,55,65,30,5,False
631,570,Zorua,Dark,NaN,370,40,65,40,80,40,65,5,False
632,571,Zoroark,Dark,NaN,570,60,105,60,120,60,105,5,False
695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
707,644,Zekrom,Dragon,Electric,840,100,150,120,120,100,90,5,True
792,716,Xerneas,Fairy,NaN,838,126,131,95,131,98,99,6,True
793,717,Yveltal,Dark,Flying,838,126,131,95,131,98,99,6,True
794,718,Zygarde50% Forme,Dragon,Ground,713,108,100,121,81,95,95,6,True

In [151]:
# Extracting first 3 characters from "Name" column
df2["Name2"] = df2.Name.str.extract(r"(^\w{3})")

In [152]:
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False,Bul
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False,Ivy
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False,Ven
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False,Ven
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False,Cha

In [153]:
# Return all rows with "Name" starting with character 'B or b'
df2.loc[df2.Name.str.match(r"(^[B|b].*)")].head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False,Bul
11,9,Blastoise,Water,NaN,614,79,83,100,85,105,78,1,False,Bla
12,9,BlastoiseMega Blastoise,Water,NaN,734,79,103,120,135,115,78,1,False,Bla
15,12,Butterfree,Bug,Flying,430,60,45,50,90,80,70,1,False,But
18,15,Beedrill,Bug,Poison,475,65,90,40,45,80,75,1,False,Bee

# Replace values in dataframe

In [154]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False,Bul
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False,Ivy
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False,Ven
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False,Ven
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False,Cha
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False,Cha
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False,Cha
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False,Cha
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

In [155]:
df2["Type 1"] = df2["Type 1"].replace({"Grass": "Meadow", "Fire": "Blaze"})

In [156]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,Poison,367,45,49,49,65,65,45,1,False,Bul
1,2,Ivysaur,Meadow,Poison,467,60,62,63,80,80,60,1,False,Ivy
2,3,Venusaur,Meadow,Poison,607,80,82,83,100,100,80,1,False,Ven
3,3,VenusaurMega Venusaur,Meadow,Poison,725,80,100,123,122,120,80,1,False,Ven
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Blaze,NaN,447,58,64,58,80,65,80,1,False,Cha
6,6,Charizard,Blaze,Flying,596,78,84,78,109,85,100,1,False,Cha
7,6,CharizardMega Charizard X,Blaze,Dragon,742,78,130,111,130,85,100,1,False,Cha
8,6,CharizardMega Charizard Y,Blaze,Flying,716,78,104,78,159,115,100,1,False,Cha
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

In [157]:
df2["Type 2"] = df2["Type 2"].replace({"Poison": "Venom"})

In [158]:
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,Venom,367,45,49,49,65,65,45,1,False,Bul
1,2,Ivysaur,Meadow,Venom,467,60,62,63,80,80,60,1,False,Ivy
2,3,Venusaur,Meadow,Venom,607,80,82,83,100,100,80,1,False,Ven
3,3,VenusaurMega Venusaur,Meadow,Venom,725,80,100,123,122,120,80,1,False,Ven
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha

In [159]:
df2["Type 2"] = df2["Type 2"].replace(["Venom", "Dragon"], "DANGER")

In [160]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,DANGER,367,45,49,49,65,65,45,1,False,Bul
1,2,Ivysaur,Meadow,DANGER,467,60,62,63,80,80,60,1,False,Ivy
2,3,Venusaur,Meadow,DANGER,607,80,82,83,100,100,80,1,False,Ven
3,3,VenusaurMega Venusaur,Meadow,DANGER,725,80,100,123,122,120,80,1,False,Ven
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Blaze,NaN,447,58,64,58,80,65,80,1,False,Cha
6,6,Charizard,Blaze,Flying,596,78,84,78,109,85,100,1,False,Cha
7,6,CharizardMega Charizard X,Blaze,DANGER,742,78,130,111,130,85,100,1,False,Cha
8,6,CharizardMega Charizard Y,Blaze,Flying,716,78,104,78,159,115,100,1,False,Cha
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

In [161]:
df2.loc[df2["Type 2"] == "DANGER", "Name2"] = np.NaN

In [162]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,DANGER,367,45,49,49,65,65,45,1,False,NaN
1,2,Ivysaur,Meadow,DANGER,467,60,62,63,80,80,60,1,False,NaN
2,3,Venusaur,Meadow,DANGER,607,80,82,83,100,100,80,1,False,NaN
3,3,VenusaurMega Venusaur,Meadow,DANGER,725,80,100,123,122,120,80,1,False,NaN
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Blaze,NaN,447,58,64,58,80,65,80,1,False,Cha
6,6,Charizard,Blaze,Flying,596,78,84,78,109,85,100,1,False,Cha
7,6,CharizardMega Charizard X,Blaze,DANGER,742,78,130,111,130,85,100,1,False,NaN
8,6,CharizardMega Charizard Y,Blaze,Flying,716,78,104,78,159,115,100,1,False,Cha
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

In [167]:
df2.loc[df2['Total'] > 400, 'Total':'Speed']

     Total  HP  Attack  Defense  Sp. Atk  Sp. Def  Speed
1      467  60      62       63       80       80     60
2      607  80      82       83      100      100     80
3      725  80     100      123      122      120     80
5      447  58      64       58       80       65     80
6      596  78      84       78      109       85    100
..     ...  ..     ...      ...      ...      ...    ...
795    700  50     100      150      100      150     50
796    800  50     160      110      160      110    110
797    720  80     110       60      150      130     70
798    840  80     160       60      170      130     80
799    720  80     110      120      130       90     70

[588 rows x 7 columns]

In [168]:
df2.loc[df2["Total"] > 400, ["Name2", "Legendary"]] = "ALERT"
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,DANGER,367,45,49,49,65,65,45,1,False,NaN
1,2,Ivysaur,Meadow,DANGER,467,60,62,63,80,80,60,1,ALERT,ALERT
2,3,Venusaur,Meadow,DANGER,607,80,82,83,100,100,80,1,ALERT,ALERT
3,3,VenusaurMega Venusaur,Meadow,DANGER,725,80,100,123,122,120,80,1,ALERT,ALERT
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Blaze,NaN,447,58,64,58,80,65,80,1,ALERT,ALERT
6,6,Charizard,Blaze,Flying,596,78,84,78,109,85,100,1,ALERT,ALERT
7,6,CharizardMega Charizard X,Blaze,DANGER,742,78,130,111,130,85,100,1,ALERT,ALERT
8,6,CharizardMega Charizard Y,Blaze,Flying,716,78,104,78,159,115,100,1,ALERT,ALERT
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

In [170]:
df2.loc[df2["Total"] > 400, ["Legendary", "Name2"]] = ["ALERT-1", "ALERT-2"]
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Name2
0,1,Bulbasaur,Meadow,DANGER,367,45,49,49,65,65,45,1,False,NaN
1,2,Ivysaur,Meadow,DANGER,467,60,62,63,80,80,60,1,ALERT-1,ALERT-2
2,3,Venusaur,Meadow,DANGER,607,80,82,83,100,100,80,1,ALERT-1,ALERT-2
3,3,VenusaurMega Venusaur,Meadow,DANGER,725,80,100,123,122,120,80,1,ALERT-1,ALERT-2
4,4,Charmander,Blaze,NaN,335,39,52,43,60,50,65,1,False,Cha
5,5,Charmeleon,Blaze,NaN,447,58,64,58,80,65,80,1,ALERT-1,ALERT-2
6,6,Charizard,Blaze,Flying,596,78,84,78,109,85,100,1,ALERT-1,ALERT-2
7,6,CharizardMega Charizard X,Blaze,DANGER,742,78,130,111,130,85,100,1,ALERT-1,ALERT-2
8,6,CharizardMega Charizard Y,Blaze,Flying,716,78,104,78,159,115,100,1,ALERT-1,ALERT-2
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False,Squ

# Group By

In [219]:
df = pd.read_csv("poke_updated1.csv")
df.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [221]:
df['Type 1'].value_counts()

Water       112
Normal       98
Grass        70
Bug          69
Psychic      57
Fire         52
Electric     44
Rock         44
Ghost        32
Ground       32
Dragon       32
Dark         31
Poison       28
Steel        27
Fighting     27
Ice          24
Fairy        17
Flying        4
Name: Type 1, dtype: int64

In [222]:
df.loc[:,'Total':'Generation'].groupby(["Total"]).max()

        HP  Attack  Defense  Sp. Atk  Sp. Def  Speed  Generation
Total
150     20      10       55       15       20     80           1
155     20      15       20       10       55     80           3
205     20      40       15       35       35     60           2
210     30      30       30       30       30     30           2
211     28      25       25       45       35     40           3
...    ...     ...      ...      ...      ...    ...         ...
900    125     170      100      120       90     95           5
930    100     150       90      180      160     90           3
946    106     190      100      154      100    130           1
950    105     180      100      180      100    115           3
960    100     180      160      150       90     90           3

[333 rows x 7 columns]

In [251]:
df.groupby(["Type 1"]).mean().sort_values("Attack", ascending=False).loc['Dragon':'Dark','Total':'Speed']

,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed
Type 1,,,,,,,
Dragon,662.937500,83.312500,112.125000,86.375000,96.843750,88.843750,83.031250
Fighting,517.000000,69.851852,96.777778,65.925926,53.111111,64.703704,66.074074
Ground,543.125000,73.781250,95.750000,84.843750,56.468750,62.750000,63.906250
Rock,556.068182,65.363636,92.863636,100.795455,63.340909,75.477273,55.909091
Steel,590.370370,65.222222,92.703704,126.370370,67.518519,80.629630,55.259259
Dark,524.774194,66.806452,88.387097,70.225806,74.645161,69.516129,76.161290

In [200]:
df.groupby(["Type 1"]).mean().sort_values("Defense", ascending=False).head(10)

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Type 1,,,,,,,,,,
Steel,442.851852,590.370370,65.222222,92.703704,126.370370,67.518519,80.629630,55.259259,3.851852,0.148148
Rock,392.727273,556.068182,65.363636,92.863636,100.795455,63.340909,75.477273,55.909091,3.454545,0.090909
Dragon,474.375000,662.937500,83.312500,112.125000,86.375000,96.843750,88.843750,83.031250,3.875000,0.375000
Ground,356.281250,543.125000,73.781250,95.750000,84.843750,56.468750,62.750000,63.906250,3.156250,0.125000
Ghost,486.500000,513.437500,64.437500,73.781250,81.187500,79.343750,76.468750,64.343750,4.187500,0.062500
Water,303.089286,510.705357,72.062500,74.151786,72.946429,74.812500,70.517857,65.964286,2.857143,0.035714
Ice,423.541667,514.750000,72.000000,72.750000,71.416667,77.541667,76.291667,63.458333,3.541667,0.083333
Grass,344.871429,499.700000,67.271429,73.214286,70.800000,77.500000,70.428571,61.928571,3.357143,0.042857
Bug,334.492754,445.101449,56.884058,70.971014,70.724638,53.869565,64.797101,61.681159,3.217391,0.000000
Dark,461.354839,524.774194,66.806452,88.387097,70.225806,74.645161,69.516129,76.161290,4.032258,0.064516

In [201]:
df.groupby(["Type 1"]).mean().sort_values("Speed", ascending=False).head(10)

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Type 1,,,,,,,,,,
Flying,677.750000,532.000000,70.750000,78.750000,66.250000,94.250000,72.500000,102.500000,5.500000,0.500000
Electric,363.500000,487.795455,59.795455,69.090909,66.295455,90.022727,73.704545,84.500000,3.272727,0.090909
Dragon,474.375000,662.937500,83.312500,112.125000,86.375000,96.843750,88.843750,83.031250,3.875000,0.375000
Psychic,380.807018,536.543860,70.631579,71.456140,67.684211,98.403509,86.280702,81.491228,3.385965,0.245614
Dark,461.354839,524.774194,66.806452,88.387097,70.225806,74.645161,69.516129,76.161290,4.032258,0.064516
Fire,327.403846,538.307692,69.903846,84.769231,67.769231,88.980769,72.211538,74.442308,3.211538,0.096154
Normal,319.173469,480.877551,77.275510,73.469388,59.846939,55.816327,63.724490,71.551020,3.051020,0.020408
Fighting,363.851852,517.000000,69.851852,96.777778,65.925926,53.111111,64.703704,66.074074,3.370370,0.000000
Water,303.089286,510.705357,72.062500,74.151786,72.946429,74.812500,70.517857,65.964286,2.857143,0.035714
Ghost,486.500000,513.437500,64.437500,73.781250,81.187500,79.343750,76.468750,64.343750,4.187500,0.062500

In [253]:
display(df.iloc[[0,-1]], df.sum())

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
799,721,Volcanion,Fire,Water,720,80,110,120,130,90,70,6,True

#                                                        290251
Name          BulbasaurIvysaurVenusaurVenusaurMega VenusaurC...
Type 1        GrassGrassGrassGrassFireFireFireFireFireWaterW...
Total                                                    412068
HP                                                        55407
Attack                                                    63201
Defense                                                   59074
Sp. Atk                                                   58256
Sp. Def                                                   57522
Speed                                                     54622
Generation                                                 2659
Legendary                                                    65
dtype: object

In [205]:
df.groupby(["Type 2"]).sum().head(5)

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Type 2,,,,,,,,,,
Bug,1146,1425,160,270,240,140,185,185,10,0.0
Dark,8277,11888,1511,2196,1441,1636,1397,1507,75,1.0
Dragon,8686,11200,1479,1700,1567,1773,1502,1450,75,4.0
Electric,2794,3268,529,436,410,487,441,429,24,1.0
Fairy,8718,11101,1479,1417,1699,1725,1885,1408,82,2.0

In [254]:
display(df.count(), df.iloc[[0,-1]])

#             800
Name          800
Type 1        800
Type 2        414
Total         800
HP            800
Attack        800
Defense       800
Sp. Atk       800
Sp. Def       800
Speed         800
Generation    800
Legendary     800
dtype: int64

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
799,721,Volcanion,Fire,Water,720,80,110,120,130,90,70,6,True

In [260]:
df["count1"] = 0
df["newcolumn"] = 110
display(df.iloc[[0,-1]])

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,count1,newcolumn
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False,0,110
799,721,Volcanion,Fire,Water,720,80,110,120,130,90,70,6,True,0,110

In [262]:
df["count1"] = 0
df.groupby(["Type 2"]).count()["count1"]

Type 2
Bug          3
Dark        20
Dragon      18
Electric     6
Fairy       23
Fighting    26
Fire        12
Flying      97
Ghost       14
Grass       25
Ground      35
Ice         14
Normal       4
Poison      34
Psychic     33
Rock        14
Steel       22
Water       14
Name: count1, dtype: int64

In [268]:
df["count1"] = 0
df.groupby(["Type 1"]).count()["count1"]

Type 1
Bug          69
Dark         31
Dragon       32
Electric     44
Fairy        17
Fighting     27
Fire         52
Flying        4
Ghost        32
Grass        70
Ground       32
Ice          24
Normal       98
Poison       28
Psychic      57
Rock         44
Steel        27
Water       112
Name: count1, dtype: int64

In [274]:
df["count1"] = 0
df.groupby(["Type 1", "Type 2", "Legendary"]).count().head()

                            #  Name  Total  HP  Attack  Defense  Sp. Atk  \
Type 1 Type 2   Legendary
Bug    Electric False       2     2      2   2       2        2        2
       Fighting False       2     2      2   2       2        2        2
       Fire     False       2     2      2   2       2        2        2
       Flying   False      14    14     14  14      14       14       14
       Ghost    False       1     1      1   1       1        1        1

                           Sp. Def  Speed  Generation  count1  newcolumn
Type 1 Type 2   Legendary
Bug    Electric False            2      2           2       2          2
       Fighting False            2      2           2       2          2
       Fire     False            2      2           2       2          2
       Flying   False           14     14          14      14         14
       Ghost    False            1      1           1       1          1

# Loading Data in Chunks

In [ ]:
for df in pd.read_csv("poke_updated1.csv", chunksize=10):
    print(df)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame()
for df in pd.read_csv("poke_updated1.csv", chunksize=10):
    df1 = pd.concat([df1, df])
df1.head(15)

# Stack & unstack in Pandas

In [ ]:
col = pd.MultiIndex.from_product([["2010", "2015"], ["Literacy", "GDP"]])

data = [[80, 7, 88, 6], [90, 8, 92, 7], [89, 7, 91, 8], [87, 6, 93, 8]]

df6 = pd.DataFrame(data, index=["India", "USA", "Russia", "China"], columns=col)
df6

In [ ]:
# Stack() Function stacks the columns to rows.
st_df = df6.stack()
st_df

In [ ]:
# Unstacks the row to columns
unst_df = st_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

# PIVOT Tables

In [291]:
data = {
    "Country": [
        "India",
        "USA",
        "Russia",
        "China",
        "India",
        "USA",
        "Russia",
        "China",
        "India",
        "USA",
        "Russia",
        "China",
        "India",
        "USA",
        "Russia",
        "China",
    ],
    "Year": [
        "2010",
        "2010",
        "2010",
        "2010",
        "2010",
        "2010",
        "2010",
        "2010",
        "2015",
        "2015",
        "2015",
        "2015",
        "2015",
        "2015",
        "2015",
        "2015",
    ],
    "Literacy/GDP": [
        "GDP",
        "GDP",
        "GDP",
        "GDP",
        "Literacy",
        "Literacy",
        "Literacy",
        "Literacy",
        "GDP",
        "GDP",
        "GDP",
        "GDP",
        "Literacy",
        "Literacy",
        "Literacy",
        "Literacy",
    ],
    "Value": [7, 8, 7, 6, 80, 90, 89, 87, 6, 7, 8, 8, 88, 92, 91, 93],
}

df7 = pd.DataFrame(data, columns=["Country", "Year", "Literacy/GDP", "Value"])
df7.shape

(16, 4)

In [301]:
df7.sample(10).sort_index()

   Country  Year Literacy/GDP  Value
0    India  2010          GDP      7
2   Russia  2010          GDP      7
3    China  2010          GDP      6
5      USA  2010     Literacy     90
6   Russia  2010     Literacy     89
9      USA  2015          GDP      7
10  Russia  2015          GDP      8
11   China  2015          GDP      8
12   India  2015     Literacy     88
13     USA  2015     Literacy     92

In [307]:
df7.loc[df7['Year'] == '2010', ['Value','Country','Year']]

   Value Country  Year
0      7   India  2010
1      8     USA  2010
2      7  Russia  2010
3      6   China  2010
4     80   India  2010
5     90     USA  2010
6     89  Russia  2010
7     87   China  2010

In [296]:
# Pivot table with SUM aggregation
pd.pivot_table(df7, index=["Year", "Literacy/GDP"], aggfunc="sum")

                   Value
Year Literacy/GDP
2010 GDP              28
     Literacy        346
2015 GDP              29
     Literacy        364

In [278]:
# Pivot table with MEAN aggregation
pd.pivot_table(df7, index=["Year", "Literacy/GDP"], aggfunc="mean")

                   Value
Year Literacy/GDP
2010 GDP            7.00
     Literacy      86.50
2015 GDP            7.25
     Literacy      91.00

# Hierarchical indexing

In [283]:
df7.index

RangeIndex(start=0, stop=16, step=1)

In [282]:
df8 = df7.set_index(["Year", "Literacy/GDP"])
df8

                  Country  Value
Year Literacy/GDP
2010 GDP            India      7
     GDP              USA      8
     GDP           Russia      7
     GDP            China      6
     Literacy       India     80
     Literacy         USA     90
     Literacy      Russia     89
     Literacy       China     87
2015 GDP            India      6
     GDP              USA      7
     GDP           Russia      8
     GDP            China      8
     Literacy       India     88
     Literacy         USA     92
     Literacy      Russia     91
     Literacy       China     93

In [284]:
df8.index

MultiIndex([('2010',      'GDP'),
            ('2010',      'GDP'),
            ('2010',      'GDP'),
            ('2010',      'GDP'),
            ('2010', 'Literacy'),
            ('2010', 'Literacy'),
            ('2010', 'Literacy'),
            ('2010', 'Literacy'),
            ('2015',      'GDP'),
            ('2015',      'GDP'),
            ('2015',      'GDP'),
            ('2015',      'GDP'),
            ('2015', 'Literacy'),
            ('2015', 'Literacy'),
            ('2015', 'Literacy'),
            ('2015', 'Literacy')],
           names=['Year', 'Literacy/GDP'])

In [285]:
df8.loc["2010"]

             Country  Value
Literacy/GDP
GDP            India      7
GDP              USA      8
GDP           Russia      7
GDP            China      6
Literacy       India     80
Literacy         USA     90
Literacy      Russia     89
Literacy       China     87

In [286]:
df8.loc[["2010"]]

                  Country  Value
Year Literacy/GDP
2010 GDP            India      7
     GDP              USA      8
     GDP           Russia      7
     GDP            China      6
     Literacy       India     80
     Literacy         USA     90
     Literacy      Russia     89
     Literacy       China     87

In [287]:
df8.loc["2015", "Literacy"]

                  Country  Value
Year Literacy/GDP
2015 Literacy       India     88
     Literacy         USA     92
     Literacy      Russia     91
     Literacy       China     93

In [288]:
df8.loc["2015", "Literacy"]

                  Country  Value
Year Literacy/GDP
2015 Literacy       India     88
     Literacy         USA     92
     Literacy      Russia     91
     Literacy       China     93

In [289]:
df8 = df7.set_index(["Year", "Literacy/GDP", "Country"])
df8

                           Value
Year Literacy/GDP Country
2010 GDP          India        7
                  USA          8
                  Russia       7
                  China        6
     Literacy     India       80
                  USA         90
                  Russia      89
                  China       87
2015 GDP          India        6
                  USA          7
                  Russia       8
                  China        8
     Literacy     India       88
                  USA         92
                  Russia      91
                  China       93

### SWAP Columns in Hierarchical indexing

In [ ]:
df7

In [ ]:
df8 = df7.set_index(["Year", "Literacy/GDP"])
df8

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df8.swaplevel("Year", "Literacy/GDP")
df9

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df9.swaplevel("Year", "Literacy/GDP")
df9

# Crosstab in Pandas

In [ ]:
df7

In [ ]:
pd.crosstab(df7["Literacy/GDP"], df7.Value, margins=True)

In [ ]:
# 2 way cross table
pd.crosstab(df7.Year, df7["Literacy/GDP"], margins=True)

In [ ]:
# 3 way cross table
pd.crosstab([df7.Year, df7["Literacy/GDP"]], df7.Country, margins=True)

# Row & Column Bind

### Row Bind

In [ ]:
df8 = pd.DataFrame(
    {
        "ID": [1, 2, 3, 4],
        "Name": ["Asif", "Basit", "Ross", "John"],
        "Score": [99, 66, 44, 33],
    }
)
df8

In [ ]:
df9 = pd.DataFrame(
    {
        "ID": [5, 6, 7, 8],
        "Name": ["Michelle", "Ramiro", "Vignesh", "Damon"],
        "Score": [78, 54, 77, 87],
    }
)
df9

In [ ]:
# Row Bind with concat() function
pd.concat([df8, df9])

In [ ]:
# Row Bind with append() function
df8.append(df9)

### Column Bind

In [ ]:
df10 = pd.DataFrame({"ID": [1, 2, 3, 4], "Name": ["Asif", "Basit", "Ross", "John"]})
df10

In [ ]:
df11 = pd.DataFrame({"Age": [20, 30, 35, 40], "Score": [99, 66, 44, 33]})
df11

In [ ]:
pd.concat([df10, df11], axis=1)